In [43]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [44]:
import pandas as pd
import numpy as np

In [45]:
people = pd.DataFrame(
    data = np.random.randn(5, 5),
    columns = ['a', 'b', 'c', 'd', 'e'],
    index = ['joe', 'steve', 'wes', 'jim', 'travis'] 
)

In [46]:
people.iloc[2:3, [2, 3]] = np.NaN
people

               a         b         c         d         e
joe    -0.919128  0.756592 -0.251130  0.780785 -0.423469
steve   0.169580  0.789325  0.713260  0.927571  1.645767
wes    -0.521024 -0.626800       NaN       NaN -1.247951
jim     0.896778  0.088024  0.394349  0.313179  1.131621
travis -1.273528 -0.350140  0.016176  0.100242 -1.006567

In [47]:
mappings = {
    'a': 'red',
    'b': 'red',
    'c': 'blue',
    'd': 'blue',
    'e': 'red',
    'f': 'orange'
}

In [48]:
grp_i = people.groupby(mappings, axis = 1)

In [49]:
for grp_name, grp_data in grp_i:
    print(grp_name)
    print(grp_data)
    print('=='*20)

blue
               c         d
joe    -0.251130  0.780785
steve   0.713260  0.927571
wes          NaN       NaN
jim     0.394349  0.313179
travis  0.016176  0.100242
========================================
red
               a         b         e
joe    -0.919128  0.756592 -0.423469
steve   0.169580  0.789325  1.645767
wes    -0.521024 -0.626800 -1.247951
jim     0.896778  0.088024  1.131621
travis -1.273528 -0.350140 -1.006567
========================================

In [50]:
grp_i.sum()

            blue       red
joe     0.529655 -0.586005
steve   1.640831  2.604672
wes     0.000000 -2.395775
jim     0.707528  2.116423
travis  0.116418 -2.630235

In [51]:
map_series = pd.Series(mappings)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [52]:
# Same functionality holds for Series
grp_ii = people.groupby(map_series, axis = 1)

In [53]:
for grp_name, grp_data in grp_ii:
    print(grp_name)
    print(grp_data)
    print('=='*20)

blue
               c         d
joe    -0.251130  0.780785
steve   0.713260  0.927571
wes          NaN       NaN
jim     0.394349  0.313179
travis  0.016176  0.100242
========================================
red
               a         b         e
joe    -0.919128  0.756592 -0.423469
steve   0.169580  0.789325  1.645767
wes    -0.521024 -0.626800 -1.247951
jim     0.896778  0.088024  1.131621
travis -1.273528 -0.350140 -1.006567
========================================

In [54]:
grp_i.count()

        blue  red
joe        2    3
steve      2    3
wes        0    3
jim        2    3
travis     2    3